{"Status":{"Code":200,"Description":"Successful"},"BookingDetail":{"BookingStatus":"CancellationInProgress","VoucherStatus":true,"ConfirmationNumber":"ZHWF8F","InvoiceNumber":"MW292368","CheckIn":"2025-07-19T00:00:00","CheckOut":"2025-07-20T00:00:00","BookingDate":"2025-06-12T00:00:00","NoOfRooms":1,"HotelDetails":{"HotelName":"The Leela Palace New Delhi","Rating":"FiveStar","AddressLine1":"Diplomatic Enclave Chanakyapuri ","Map":"28.60087|77.18624","City":"New Delhi"},"Rooms":[{"Currency":"USD","Status":"Not Cancelled","Name":["Deluxe Room (Grand Deluxe),1 King Bed,NonSmoking"],"Inclusion":"Free valet parking,Free self parking","TotalFare":280.76,"TotalTax":44.52,"RoomPromotion":"Member’s exclusive price","CancelPolicies":[{"FromDate":"11-06-2025 00:00:00","ChargeType":"Fixed","CancellationCharge":0.00},{"FromDate":"18-06-2025 00:00:00","ChargeType":"Percentage","CancellationCharge":100.00}],"MealType":"Room_Only","IsRefundable":true,"CustomerDetails":[{"CustomerNames":[{"Title":"Mr","FirstName":"Gaurav","LastName":"Provab","Type":"Adult"},{"Title":"Mr","FirstName":"Sunil","LastName":"Provab","Type":"Adult"}]}]}],"RateConditions":["Early check out will attract full cancellation charge unless otherwise specified.","Please note that this a special rate which should be sold only with an airline ticket as part of a package.","Please refer to the following Terms of Use -  http://bookingquotationPrep.tboholidays.com/termsofuse.pdf","CheckIn Time-Begin: 2:00 PM "," CheckIn Time-End: midnight","CheckOut Time: 12:00 PM","CheckIn Instructions: &lt;ul&gt;  &lt;li&gt;Extra-person charges may apply and vary depending on property policy&lt;/li&gt;&lt;li&gt;Government-issued photo identification and a credit card, debit card, or cash deposit may be required at check-in for incidental charges&lt;/li&gt;&lt;li&gt;Special requests are subject to availability upon check-in and may incur additional charges; special requests cannot be guaranteed&lt;/li&gt;&lt;li&gt;This property accepts credit cards, debit cards, and cash&lt;/li&gt;&lt;li&gt;Safety features at this property include a fire extinguisher, a smoke detector, a security system, a first aid kit, and window guards&lt;/li&gt;&lt;li&gt;This property has outdoor spaces, such as balconies, patios, terraces which may not be suitable for children; if you have concerns, we recommend contacting the property prior to your arrival to confirm they can accommodate you in a suitable room&lt;/li&gt;&lt;li&gt;Please note that cultural norms and guest policies may differ by country and by property; the policies listed are provided by the property&lt;/li&gt;  &lt;/ul&gt; "," Special Instructions : To make arrangements for check-in please contact the property ahead of time using the information on the booking confirmation. If you are planning to arrive after midnight please contact the property in advance using the information on the booking confirmation. Guests must contact the property in advance for check-in instructions. Front desk staff will greet guests on arrival at the property.  To register at this property, guests who are Indian citizens must provide a valid photo identity card issued by the Government of India; travelers who are not citizens of India must present a valid passport and visa.","Minimum CheckIn Age : 18"," Optional Fees: &lt;ul&gt; &lt;li&gt;Fee for buffet breakfast: approximately INR 1900 for adults and INR 900 for children&lt;/li&gt;&lt;li&gt;Airport shuttle fee: INR 5500 per vehicle (one-way)&lt;/li&gt;&lt;li&gt;Early check-in is available for a fee (subject to availability)&lt;/li&gt;&lt;li&gt;Late check-out is available for a fee (subject to availability)&lt;/li&gt;&lt;li&gt;Rollaway bed fee: INR 5000.0 per night&lt;/li&gt;&lt;/ul&gt; &lt;p&gt;The above list may not be comprehensive. Fees and deposits may not include tax and are subject to change. &lt;/p&gt;","Cards Accepted: Visa,Diners Club,Debit cards,Cash,American Express,Mastercard","&lt;ul&gt;  &lt;li&gt;Reservations are required for massage services and spa treatments. Reservations can be made by contacting the hotel prior to arrival, using the contact information on the booking confirmation. &lt;/li&gt;&lt;li&gt;Up to 2 children 12 years old and younger stay free when occupying the parent or guardian's room, using existing bedding. &lt;/li&gt;&lt;li&gt;Only registered guests are allowed in the guestrooms. &lt;/li&gt; &lt;li&gt;The property has connecting/adjoining rooms, which are subject to availability and can be requested by contacting the property using the number on the booking confirmation. &lt;/li&gt;&lt;li&gt;Some facilities may have restricted access. Guests can contact the property for details using the contact information on the booking confirmation. &lt;/li&gt;&lt;li&gt;No pets and no service animals are allowed at this property. &lt;/li&gt;&lt;li&gt;Contactless check-out is available.&lt;/li&gt;&lt;li&gt;This property welcomes guests of all sexual orientations and gender identities (LGBTQ+ friendly).&lt;/li&gt; &lt;/ul&gt;,Service animals not allowed,Pets not allowed,Professional property host/manager,Contactless check-out is available,LGBTQ friendly,EarthCheck"]}}